In [1]:
import pandas as pd
import os
import numpy

In [ ]:
# reading file
df = pd.read_csv(r'data.csv')

In [3]:
df.education.unique()

array(["Master's & above", "Bachelor's", nan, 'Below Secondary'],
      dtype=object)

In [4]:
g = df.groupby('education')
g

In [34]:
for education, df in g:
    print(education)
    print(df.iloc[:,:5].head())

Bachelor's
   employee_id         department     region   education gender
1        65141         Operations  region_22  Bachelor's      m
2         7513  Sales & Marketing  region_19  Bachelor's      m
3         2542  Sales & Marketing  region_23  Bachelor's      m
4        48945         Technology  region_26  Bachelor's      m
5        58896          Analytics   region_2  Bachelor's      m
Below Secondary
     employee_id   department     region        education gender
210        11800  Procurement   region_2  Below Secondary      f
272        35873        Legal   region_2  Below Secondary      m
311        18651        Legal  region_22  Below Secondary      m
318        67467      Finance   region_2  Below Secondary      f
334        74579   Operations   region_2  Below Secondary      m
Master's & above
    employee_id         department     region         education gender
0         65438  Sales & Marketing   region_7  Master's & above      f
7         16290         Operations  region_34  Master's & above      m
9         28911  Sales & Marketing   region_1  Master's & above      m
13        38401         Technology  region_29  Master's & above      m
14        77040                R&D   region_2  Master's & above      m

In [36]:
print(g.max().iloc[:,:5])

employee_id  department    region gender recruitment_channel
education
Bachelor's              78297  Technology  region_9      m            sourcing
Below Secondary         78084  Technology  region_7      m            sourcing
Master's & above        78298  Technology  region_9      m            sourcing

In [46]:
print(g.mean().iloc[:]['employee_id']) # OR print(g.mean().iloc[:,:1])

education
Bachelor's          39154.777387
Below Secondary     38515.060870
Master's & above    39292.533735
Name: employee_id, dtype: float64

## Merge DataFrames

In [49]:
temp_df = pd.DataFrame({"City": ["Hyderabad","Mumbai","delhi"], "Temperature":[32,56,78]})
temp_df

        City  Temperature
0  Hyderabad           32
1     Mumbai           56
2      delhi           78

In [57]:
humid_df = pd.DataFrame({"City": ["Hyderabad","Mumbai","delhi"], "Humidity":[42,76,98]})
humid_df

        City  Humidity
0  Hyderabad        42
1     Mumbai        76
2      delhi        98

In [59]:
merge_df = pd.merge(temp_df,humid_df, on = 'City', how = 'outer')
merge_df

        City  Temperature  Humidity
0  Hyderabad           32        42
1     Mumbai           56        76
2      delhi           78        98

### Numerical Indexing (.loc vs iloc)

In [60]:
# .loc uses index no.
# .iloc uses row no.
#=========================================
# want corresponding value at inxed 46 -> .loc
# want corresponding value at row 3 -> .iloc

In [5]:
s = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index= [49,48,27,46,45,1,2,3,4,5])
s

     0
49   1
48   2
27   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [62]:
s.loc[46] # -> .loc uses index to access the data

0    4
Name: 46, dtype: int64

In [63]:
s.iloc[3] # -> .iloc uses row number to access the data

0    4
Name: 46, dtype: int64

In [64]:
##  goes record by record and prints the value till index reaches 
s.loc[:2]

    0
49  1
48  2
27  3
46  4
45  5
1   6
2   7

In [65]:
##  prints only 2 rows as .iloc corresponds to rows 
s.iloc[:2]

    0
49  1
48  2

In [6]:
import pdb

In [9]:
def pr():
    print('hi')
    a = 5656
    pdb.set_trace()
    print('hello')
    b = 9898
pr()

hi
> <ipython-input-9-61b4dcd78e7d>(5)pr()
      3     a = 5656
      4     pdb.set_trace()
----> 5     print('hello')
      6     b = 9898
      7 pr()

ipdb> a
ipdb> p a
5656
ipdb> c
hello

In [14]:
from datetime import datetime
now = datetime.now()

In [15]:
now.strftime("%H_%M")

'23_05'

In [16]:
now.strftime("%H_%M")

'23_05'